---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyByPatternFamilies
source: html/b655167b-8f37-799c-7894-9a3b8fcfc6f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotCopyByPatternFamilies Property

Can't copy between Mass or Curtain Panel by Pattern families, and other families or Revit projects.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyByPatternFamilies { get; }
```